<a href="https://colab.research.google.com/github/Boitymellow95/boitumelo-makgoba/blob/master/Copy_of_research%20results.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import seaborn as sns 
import matplotlib.pyplot as plt 
import warnings
from sklearn import preprocessing, svm 
from sklearn.linear_model import Perceptron
from sklearn.linear_model import Perceptron
from sklearn.tree import DecisionTreeClassifier
from sklearn.linear_model import Perceptron
from sklearn.tree import DecisionTreeClassifier
#ignore warnings
warnings.filterwarnings('ignore')

In [ ]:
 assessments = pd.read_csv ("assessments.csv") 
 studentInfo = pd.read_csv ("studentInfo.csv")
 studentVle = pd.read_csv ("studentVle.csv")
 vle = pd.read_csv ("vle.csv")

In [ ]:
assessments.head()

  code_module code_presentation  id_assessment assessment_type   date  weight
0         AAA             2013J           1752             TMA   19.0    10.0
1         AAA             2013J           1753             TMA   54.0    20.0
2         AAA             2013J           1754             TMA  117.0    20.0
3         AAA             2013J           1755             TMA  166.0    20.0
4         AAA             2013J           1756             TMA  215.0    30.0

In [ ]:
studentInfo.tail()

      code_module code_presentation  ...  disability final_result
32588         GGG             2014J  ...           N         Fail
32589         GGG             2014J  ...           N  Distinction
32590         GGG             2014J  ...           Y         Pass
32591         GGG             2014J  ...           N    Withdrawn
32592         GGG             2014J  ...           N  Distinction

[5 rows x 12 columns]

In [ ]:
studentVle.head()

  code_module code_presentation  id_student  id_site  date  sum_click
0         AAA             2013J       28400   546652   -10          4
1         AAA             2013J       28400   546652   -10          1
2         AAA             2013J       28400   546652   -10          1
3         AAA             2013J       28400   546614   -10         11
4         AAA             2013J       28400   546714   -10          1

In [ ]:
vle.head()

   id_site code_module code_presentation activity_type  week_from  week_to
0   546943         AAA             2013J      resource        NaN      NaN
1   546712         AAA             2013J     oucontent        NaN      NaN
2   546998         AAA             2013J      resource        NaN      NaN
3   546888         AAA             2013J           url        NaN      NaN
4   547035         AAA             2013J      resource        NaN      NaN

In [ ]:
assesments.describe(include='all')

NameError: ignored

In [ ]:
student_df = pd.merge(studentInfo,studentVle,on=['code_module','code_presentation'], how="right" )

In [ ]:
student_df = pd.merge(vle,assessments, on=['code_module','code_presentation'], how= 'left')

student_df = pd.merge(student_df,studentVle, on=['code_module','code_presentation'], how= 'left')

student_df.head()